// Λίστα με τα ζευγάρια συνδιδασκαλίας
// Αυτόματα δημιουργημένο από generate-coteaching.js
// Format: { teachers: ['ΟΝΟΜΑ1', 'ΟΝΟΜΑ2'], class: 'Τμήμα', day: 'Ημέρα', period: 'Περίοδος' }

export const coteachingPairs = [
  {
    "teachers": [
      "ΞΕΝΟΦΩΝΤΟΣ ΜΑΡΙΑ",
      "ΣΠΥΡΙΔΩΝΟΣ ΜΑΡΙΑ"
    ],
    "class": "Α11",
    "day": "Δευτέρα",
    "period": "3",
    "subjects": [
      "Α11_ΦΧ_ΧΧημεία (Α)B124",
      "Α11_ΦΧ_ΦΦυσική (Α)B261"
    ]
  },
  {
    "teachers": [
      "ΕΥΣΤΑΘΙΟΥ ΤΑΣΟΣ",
      "ΚΟΥΣΟΥΛΟΥ ΓΕΩΡΓΙΑ"
    ],
    "class": "Α21",
    "day": "Δευτέρα",
    "period": "3",
    "subjects": [
      "Α21_ΦΤ_ΤΣχεδ. & Τεχνολογία…B101",
      "Α21_ΦΤ_ΦΦυσική Προσ (Α)B123"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ52",
    "day": "Δευτέρα",
    "period": "3",
    "subjects": [
      "ΓυμΓ52+Γ53_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ52+Γ53_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ53",
    "day": "Δευτέρα",
    "period": "3",
    "subjects": [
      "ΓυμΓ52+Γ53_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ52+Γ53_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΕΥΣΤΑΘΙΟΥ ΤΑΣΟΣ",
      "ΣΥΚΟΠΕΤΡΙΤΗΣ ΙΩΑΚΕΙΜ"
    ],
    "class": "Α41",
    "day": "Δευτέρα",
    "period": "4",
    "subjects": [
      "Α41_ΠΤ_ΤΣχεδ. & Τεχνολογία…B101",
      "Α41_ΠΤ_ΠΠληροφορική (Α)Ε136"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β11",
    "day": "Δευτέρα",
    "period": "4",
    "subjects": [
      "ΓυμΒ11+Β32_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ11+Β32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β32",
    "day": "Δευτέρα",
    "period": "4",
    "subjects": [
      "ΓυμΒ11+Β32_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ11+Β32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΝΤΩΝΙΟΥ ΝΙΚΗ",
      "ΧΡΙΣΤΟΥ ΠΡΟΔΡΟΜΟΣ"
    ],
    "class": "Α11",
    "day": "Δευτέρα",
    "period": "5",
    "subjects": [
      "Α11_ΠΤ_ΠΠληροφορική (Α)Γ133",
      "Α11_ΠΤ_ΤΣχεδ. & Τεχνολογία…B102"
    ]
  },
  {
    "teachers": [
      "ΞΕΝΟΦΩΝΤΟΣ ΜΑΡΙΑ",
      "ΧΑΡΑΛΑΜΠΟΥΣ ΘΑΣΟΣ"
    ],
    "class": "Α21",
    "day": "Δευτέρα",
    "period": "5",
    "subjects": [
      "Α21_ΧΠ_ΧΧημεία (Α)B124",
      "Α21_ΧΠ_ΠΠληροφορική (Α)Ε135"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α31",
    "day": "Δευτέρα",
    "period": "5",
    "subjects": [
      "ΓυμΑ31+Α32_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ31+Α32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α32",
    "day": "Δευτέρα",
    "period": "5",
    "subjects": [
      "ΓυμΑ31+Α32_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ31+Α32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΕΥΣΤΑΘΙΟΥ ΤΑΣΟΣ",
      "ΣΥΚΟΠΕΤΡΙΤΗΣ ΙΩΑΚΕΙΜ"
    ],
    "class": "Α41",
    "day": "Δευτέρα",
    "period": "5",
    "subjects": [
      "Α41_ΤΠ_ΤΣχεδ. & Τεχνολογία…B101",
      "Α41_ΤΠ_ΠΠληροφορική (Α)Ε136"
    ]
  },
  {
    "teachers": [
      "ΑΝΤΩΝΙΟΥ ΝΙΚΗ",
      "ΚΟΥΣΟΥΛΟΥ ΓΕΩΡΓΙΑ"
    ],
    "class": "Α21",
    "day": "Δευτέρα",
    "period": "6",
    "subjects": [
      "Α21_ΠΦ_ΠΠληροφορική (Α)Γ133",
      "Α21_ΠΦ_ΦΦυσική Προσ (Α)B123"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ41",
    "day": "Δευτέρα",
    "period": "8",
    "subjects": [
      "ΓυμΓ41+Γ51_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ41+Γ51_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ51",
    "day": "Δευτέρα",
    "period": "8",
    "subjects": [
      "ΓυμΓ41+Γ51_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ41+Γ51_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΑΝΤΩΝΙΟΥ ΣΤΕΛΛΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ1",
    "day": "Τρίτη",
    "period": "1",
    "subjects": [
      "ΓυμΓ1+Γ31+Γ32_Κ1Φυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ1+Γ31+Γ32_Κ2Φυσική Αγωγή Κορ…Γηπ3",
      "ΓυμΓ1+Γ31+Γ32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΑΝΤΩΝΙΟΥ ΣΤΕΛΛΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ31",
    "day": "Τρίτη",
    "period": "1",
    "subjects": [
      "ΓυμΓ1+Γ31+Γ32_Κ1Φυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ1+Γ31+Γ32_Κ2Φυσική Αγωγή Κορ…Γηπ3",
      "ΓυμΓ1+Γ31+Γ32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΑΝΤΩΝΙΟΥ ΣΤΕΛΛΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ32",
    "day": "Τρίτη",
    "period": "1",
    "subjects": [
      "ΓυμΓ1+Γ31+Γ32_Κ1Φυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ1+Γ31+Γ32_Κ2Φυσική Αγωγή Κορ…Γηπ3",
      "ΓυμΓ1+Γ31+Γ32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΕΥΣΤΑΘΙΟΥ ΤΑΣΟΣ",
      "ΧΑΡΑΛΑΜΠΟΥΣ ΘΑΣΟΣ"
    ],
    "class": "Α21",
    "day": "Τρίτη",
    "period": "2",
    "subjects": [
      "Α21_ΠΤ_ΤΣχεδ. & Τεχνολογία…B101",
      "Α21_ΠΤ_ΠΠληροφορική (Α)Ε135"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΑΝΤΩΝΙΟΥ ΣΤΕΛΛΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ1",
    "day": "Τρίτη",
    "period": "2",
    "subjects": [
      "ΓυμΓ1+Γ31+Γ32_Κ1Φυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ1+Γ31+Γ32_Κ2Φυσική Αγωγή Κορ…Γηπ3",
      "ΓυμΓ1+Γ31+Γ32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΑΝΤΩΝΙΟΥ ΣΤΕΛΛΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ31",
    "day": "Τρίτη",
    "period": "2",
    "subjects": [
      "ΓυμΓ1+Γ31+Γ32_Κ1Φυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ1+Γ31+Γ32_Κ2Φυσική Αγωγή Κορ…Γηπ3",
      "ΓυμΓ1+Γ31+Γ32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΑΝΤΩΝΙΟΥ ΣΤΕΛΛΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ32",
    "day": "Τρίτη",
    "period": "2",
    "subjects": [
      "ΓυμΓ1+Γ31+Γ32_Κ1Φυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ1+Γ31+Γ32_Κ2Φυσική Αγωγή Κορ…Γηπ3",
      "ΓυμΓ1+Γ31+Γ32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΙΩΑΚΕΙΜ ΙΩΑΚΕΙΜ",
      "ΣΠΥΡΙΔΩΝΟΣ ΜΑΡΙΑ"
    ],
    "class": "Α22",
    "day": "Τρίτη",
    "period": "3",
    "subjects": [
      "Α22_ΠΦ_ΠΠληροφορική (Α)Δ128",
      "Α22_ΠΦ_ΦΦυσική Προσ (Α)B261"
    ]
  },
  {
    "teachers": [
      "ΣΠΥΡΙΔΩΝΟΣ ΜΑΡΙΑ",
      "ΧΡΙΣΤΟΥ ΠΡΟΔΡΟΜΟΣ"
    ],
    "class": "Α22",
    "day": "Τρίτη",
    "period": "4",
    "subjects": [
      "Α22_ΦΤ_ΦΦυσική Προσ (Α)B261",
      "Α22_ΦΤ_ΤΣχεδ. & Τεχνολογία…B102"
    ]
  },
  {
    "teachers": [
      "ΞΕΝΟΦΩΝΤΟΣ ΜΑΡΙΑ",
      "ΟΡΦΑΝΙΔΟΥ ΔΩΡΑ"
    ],
    "class": "Α41",
    "day": "Τρίτη",
    "period": "4",
    "subjects": [
      "Α41_ΦΧ_ΧΧημεία (Α)B124",
      "Α41_ΦΧ_ΦΦυσική (Α)B123"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α11",
    "day": "Τρίτη",
    "period": "5",
    "subjects": [
      "ΓυμΑ11+Α43_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ11+Α43_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α43",
    "day": "Τρίτη",
    "period": "5",
    "subjects": [
      "ΓυμΑ11+Α43_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ11+Α43_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΙΩΑΚΕΙΜ ΙΩΑΚΕΙΜ",
      "ΧΡΙΣΤΟΥ ΠΡΟΔΡΟΜΟΣ"
    ],
    "class": "Α22",
    "day": "Τρίτη",
    "period": "6",
    "subjects": [
      "Α22_ΠΤ_ΠΠληροφορική (Α)Δ128",
      "Α22_ΠΤ_ΤΣχεδ. & Τεχνολογία…B102"
    ]
  },
  {
    "teachers": [
      "ΕΥΣΤΑΘΙΟΥ ΤΑΣΟΣ",
      "ΣΥΚΟΠΕΤΡΙΤΗΣ ΙΩΑΚΕΙΜ"
    ],
    "class": "Α41",
    "day": "Τρίτη",
    "period": "6",
    "subjects": [
      "Α41_ΤΠ_ΤΣχεδ. & Τεχνολογία…B101",
      "Α41_ΤΠ_ΠΠληροφορική (Α)Ε136"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β33",
    "day": "Τρίτη",
    "period": "6",
    "subjects": [
      "ΓυμΒ33+Β51+Β52_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ33+Β51+Β52_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β51",
    "day": "Τρίτη",
    "period": "6",
    "subjects": [
      "ΓυμΒ33+Β51+Β52_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ33+Β51+Β52_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β52",
    "day": "Τρίτη",
    "period": "6",
    "subjects": [
      "ΓυμΒ33+Β51+Β52_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ33+Β51+Β52_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΕΥΣΤΑΘΙΟΥ ΤΑΣΟΣ",
      "ΣΥΚΟΠΕΤΡΙΤΗΣ ΙΩΑΚΕΙΜ"
    ],
    "class": "Α41",
    "day": "Τρίτη",
    "period": "7",
    "subjects": [
      "Α41_ΠΤ_ΤΣχεδ. & Τεχνολογία…B101",
      "Α41_ΠΤ_ΠΠληροφορική (Α)Ε136"
    ]
  },
  {
    "teachers": [
      "ΑΝΤΩΝΙΟΥ ΝΙΚΗ",
      "ΧΡΙΣΤΟΥ ΠΡΟΔΡΟΜΟΣ"
    ],
    "class": "Α11",
    "day": "Τετάρτη",
    "period": "2",
    "subjects": [
      "Α11_ΠΤ_ΠΠληροφορική (Α)Γ133",
      "Α11_ΠΤ_ΤΣχεδ. & Τεχνολογία…B102"
    ]
  },
  {
    "teachers": [
      "ΞΕΝΟΦΩΝΤΟΣ ΜΑΡΙΑ",
      "ΣΠΥΡΙΔΩΝΟΣ ΜΑΡΙΑ"
    ],
    "class": "Α11",
    "day": "Τετάρτη",
    "period": "3",
    "subjects": [
      "Α11_ΧΦ_ΧΧημεία (Α)B124",
      "Α11_ΧΦ_ΦΦυσική (Α)B261"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β33",
    "day": "Τετάρτη",
    "period": "3",
    "subjects": [
      "ΓυμΒ33+Β51+Β52_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ33+Β51+Β52_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β51",
    "day": "Τετάρτη",
    "period": "3",
    "subjects": [
      "ΓυμΒ33+Β51+Β52_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ33+Β51+Β52_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β52",
    "day": "Τετάρτη",
    "period": "3",
    "subjects": [
      "ΓυμΒ33+Β51+Β52_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ33+Β51+Β52_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α21",
    "day": "Τετάρτη",
    "period": "4",
    "subjects": [
      "ΓυμΑ21+Α22_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ21+Α22_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α22",
    "day": "Τετάρτη",
    "period": "4",
    "subjects": [
      "ΓυμΑ21+Α22_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ21+Α22_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΞΕΝΟΦΩΝΤΟΣ ΜΑΡΙΑ",
      "ΧΡΙΣΤΟΥ ΠΡΟΔΡΟΜΟΣ"
    ],
    "class": "Α22",
    "day": "Τετάρτη",
    "period": "5",
    "subjects": [
      "Α22_ΤΧ_ΧΧημεία (Α)B124",
      "Α22_ΤΧ_ΤΣχεδ. & Τεχνολογία…B123"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α41",
    "day": "Τετάρτη",
    "period": "5",
    "subjects": [
      "ΓυμΑ41+Α42_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ41+Α42_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α42",
    "day": "Τετάρτη",
    "period": "5",
    "subjects": [
      "ΓυμΑ41+Α42_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ41+Α42_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α31",
    "day": "Τετάρτη",
    "period": "6",
    "subjects": [
      "ΓυμΑ31+Α32_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ31+Α32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α32",
    "day": "Τετάρτη",
    "period": "6",
    "subjects": [
      "ΓυμΑ31+Α32_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ31+Α32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β11",
    "day": "Πέμπτη",
    "period": "1",
    "subjects": [
      "ΓυμΒ11+Β32_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ11+Β32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β32",
    "day": "Πέμπτη",
    "period": "1",
    "subjects": [
      "ΓυμΒ11+Β32_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ11+Β32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΕΥΣΤΑΘΙΟΥ ΤΑΣΟΣ",
      "ΞΕΝΟΦΩΝΤΟΣ ΜΑΡΙΑ"
    ],
    "class": "Α21",
    "day": "Πέμπτη",
    "period": "3",
    "subjects": [
      "Α21_ΤΧ_ΤΣχεδ. & Τεχνολογία…B101",
      "Α21_ΤΧ_ΧΧημεία (Α)B124"
    ]
  },
  {
    "teachers": [
      "ΣΠΥΡΙΔΩΝΟΣ ΜΑΡΙΑ",
      "ΧΡΙΣΤΟΥ ΠΡΟΔΡΟΜΟΣ"
    ],
    "class": "Α22",
    "day": "Πέμπτη",
    "period": "3",
    "subjects": [
      "Α22_ΦΤ_ΦΦυσική Προσ (Α)B261",
      "Α22_ΦΤ_ΤΣχεδ. & Τεχνολογία…B102"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α23",
    "day": "Πέμπτη",
    "period": "3",
    "subjects": [
      "ΓυμΑ23+Α24_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ23+Α24_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α24",
    "day": "Πέμπτη",
    "period": "3",
    "subjects": [
      "ΓυμΑ23+Α24_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ23+Α24_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΝΤΩΝΙΟΥ ΝΙΚΗ",
      "ΧΡΙΣΤΟΥ ΠΡΟΔΡΟΜΟΣ"
    ],
    "class": "Α11",
    "day": "Πέμπτη",
    "period": "4",
    "subjects": [
      "Α11_ΤΠ_ΠΠληροφορική (Α)Γ133",
      "Α11_ΤΠ_ΤΣχεδ. & Τεχνολογία…B102"
    ]
  },
  {
    "teachers": [
      "ΙΩΑΚΕΙΜ ΙΩΑΚΕΙΜ",
      "ΣΠΥΡΙΔΩΝΟΣ ΜΑΡΙΑ"
    ],
    "class": "Α22",
    "day": "Πέμπτη",
    "period": "4",
    "subjects": [
      "Α22_ΠΦ_ΠΠληροφορική (Α)Δ128",
      "Α22_ΠΦ_ΦΦυσική Προσ (Α)B261"
    ]
  },
  {
    "teachers": [
      "ΞΕΝΟΦΩΝΤΟΣ ΜΑΡΙΑ",
      "ΟΡΦΑΝΙΔΟΥ ΔΩΡΑ"
    ],
    "class": "Α41",
    "day": "Πέμπτη",
    "period": "4",
    "subjects": [
      "Α41_ΧΦ_ΧΧημεία (Α)B124",
      "Α41_ΧΦ_ΦΦυσική (Α)B123"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ41",
    "day": "Πέμπτη",
    "period": "4",
    "subjects": [
      "ΓυμΓ41+Γ51_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ41+Γ51_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ51",
    "day": "Πέμπτη",
    "period": "4",
    "subjects": [
      "ΓυμΓ41+Γ51_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ41+Γ51_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΙΩΑΚΕΙΜ ΙΩΑΚΕΙΜ",
      "ΞΕΝΟΦΩΝΤΟΣ ΜΑΡΙΑ"
    ],
    "class": "Α22",
    "day": "Πέμπτη",
    "period": "5",
    "subjects": [
      "Α22_ΧΠ_ΠΠληροφορική (Α)Δ128",
      "Α22_ΧΠ_ΧΧημεία (Α)B124"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β31",
    "day": "Πέμπτη",
    "period": "5",
    "subjects": [
      "ΓυμΒ31+Β41_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ31+Β41_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β41",
    "day": "Πέμπτη",
    "period": "5",
    "subjects": [
      "ΓυμΒ31+Β41_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ31+Β41_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ52",
    "day": "Πέμπτη",
    "period": "8",
    "subjects": [
      "ΓυμΓ52+Γ53_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ52+Γ53_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Γ53",
    "day": "Πέμπτη",
    "period": "8",
    "subjects": [
      "ΓυμΓ52+Γ53_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΓ52+Γ53_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΝΤΩΝΙΟΥ ΝΙΚΗ",
      "ΧΡΙΣΤΟΥ ΠΡΟΔΡΟΜΟΣ"
    ],
    "class": "Α11",
    "day": "Παρασκευή",
    "period": "3",
    "subjects": [
      "Α11_ΤΠ_ΠΠληροφορική (Α)Γ133",
      "Α11_ΤΠ_ΤΣχεδ. & Τεχνολογία…B102"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α21",
    "day": "Παρασκευή",
    "period": "3",
    "subjects": [
      "ΓυμΑ21+Α22_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ21+Α22_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Α22",
    "day": "Παρασκευή",
    "period": "3",
    "subjects": [
      "ΓυμΑ21+Α22_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΑ21+Α22_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΝΤΩΝΙΟΥ ΝΙΚΗ",
      "ΚΟΥΣΟΥΛΟΥ ΓΕΩΡΓΙΑ"
    ],
    "class": "Α21",
    "day": "Παρασκευή",
    "period": "4",
    "subjects": [
      "Α21_ΠΦ_ΠΠληροφορική (Α)Γ133",
      "Α21_ΠΦ_ΦΦυσική Προσ (Α)B121"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β31",
    "day": "Παρασκευή",
    "period": "4",
    "subjects": [
      "ΓυμΒ31+Β41_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ31+Β41_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β41",
    "day": "Παρασκευή",
    "period": "4",
    "subjects": [
      "ΓυμΒ31+Β41_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ31+Β41_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΕΥΣΤΑΘΙΟΥ ΤΑΣΟΣ",
      "ΚΟΥΣΟΥΛΟΥ ΓΕΩΡΓΙΑ"
    ],
    "class": "Α21",
    "day": "Παρασκευή",
    "period": "5",
    "subjects": [
      "Α21_ΦΤ_ΤΣχεδ. & Τεχνολογία…B101",
      "Α21_ΦΤ_ΦΦυσική Προσ (Α)B123"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β11",
    "day": "Παρασκευή",
    "period": "6",
    "subjects": [
      "ΓυμΒ11+Β32_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ11+Β32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β32",
    "day": "Παρασκευή",
    "period": "6",
    "subjects": [
      "ΓυμΒ11+Β32_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ11+Β32_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β33",
    "day": "Παρασκευή",
    "period": "7",
    "subjects": [
      "ΓυμΒ33+Β51+Β52_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ33+Β51+Β52_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β51",
    "day": "Παρασκευή",
    "period": "7",
    "subjects": [
      "ΓυμΒ33+Β51+Β52_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ33+Β51+Β52_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  },
  {
    "teachers": [
      "ΑΛΕΞΑΝΔΡΟΥ ΧΡΙΣΤΙΝΑ",
      "ΦΕΛΛΑ ΟΡΦΕΑΣ"
    ],
    "class": "Β52",
    "day": "Παρασκευή",
    "period": "7",
    "subjects": [
      "ΓυμΒ33+Β51+Β52_ΚΦυσική Αγωγή Κορ…Γηπ2",
      "ΓυμΒ33+Β51+Β52_ΑΦυσική Αγωγή Αγο…Γηπ1"
    ]
  }
];

/**
 * Ελέγχει αν δύο καθηγητές έχουν συνδιδασκαλία μια συγκεκριμένη ημέρα και περίοδο
 * @param {string} teacher1 - Όνομα πρώτου καθηγητή
 * @param {string} teacher2 - Όνομα δεύτερου καθηγητή
 * @param {string} day - Ημέρα (π.χ. 'Δευτέρα')
 * @param {string} period - Περίοδος (π.χ. '3')
 * @returns {boolean} - true αν έχουν συνδιδασκαλία, false αλλιώς
 */
export const hasCoteaching = (teacher1, teacher2, day, period) => {
  const t1 = teacher1.toUpperCase().trim();
  const t2 = teacher2.toUpperCase().trim();

  return coteachingPairs.some(pair => {
    // Έλεγχος αν οι δύο καθηγητές είναι στο ίδιο ζευγάρι
    const hasTeachers = pair.teachers.some(t => t.toUpperCase().trim() === t1) &&
                        pair.teachers.some(t => t.toUpperCase().trim() === t2);

    // Έλεγχος αν ταιριάζει η ημέρα και η περίοδος
    const matchesDayPeriod = pair.day === day && pair.period === period;

    return hasTeachers && matchesDayPeriod;
  });
};

/**
 * Επιστρέφει όλες τις συνδιδασκαλίες ενός καθηγητή
 * @param {string} teacherName - Όνομα καθηγητή
 * @returns {Array} - Λίστα με τις συνδιδασκαλίες του καθηγητή
 */
export const getCoteachingsForTeacher = (teacherName) => {
  const name = teacherName.toUpperCase().trim();

  return coteachingPairs.filter(pair =>
    pair.teachers.some(t => t.toUpperCase().trim() === name)
  );
};
